espressif/esp-idf/components/soc/esp32c5/register/soc/pvt_reg.h
/**
 * SPDX-FileCopyrightText: 2025-2026 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** PVT_PMUP_BITMAP_HIGH0_REG register
 *  select valid pvt channel
 */
#define PVT_PMUP_BITMAP_HIGH0_REG (DR_REG_PVT_BASE + 0x0)
/** PVT_PUMP_BITMAP_HIGH0 : R/W; bitpos: [31:0]; default: 0;
 *  select valid high channel0
 */
#define PVT_PUMP_BITMAP_HIGH0    0xFFFFFFFFU
#define PVT_PUMP_BITMAP_HIGH0_M  (PVT_PUMP_BITMAP_HIGH0_V << PVT_PUMP_BITMAP_HIGH0_S)
#define PVT_PUMP_BITMAP_HIGH0_V  0xFFFFFFFFU
#define PVT_PUMP_BITMAP_HIGH0_S  0

/** PVT_PMUP_BITMAP_HIGH1_REG register
 *  select valid pvt channel
 */
#define PVT_PMUP_BITMAP_HIGH1_REG (DR_REG_PVT_BASE + 0x4)
/** PVT_PUMP_BITMAP_HIGH1 : R/W; bitpos: [31:0]; default: 0;
 *  select valid high channel1
 */
#define PVT_PUMP_BITMAP_HIGH1    0xFFFFFFFFU
#define PVT_PUMP_BITMAP_HIGH1_M  (PVT_PUMP_BITMAP_HIGH1_V << PVT_PUMP_BITMAP_HIGH1_S)
#define PVT_PUMP_BITMAP_HIGH1_V  0xFFFFFFFFU
#define PVT_PUMP_BITMAP_HIGH1_S  0

/** PVT_PMUP_BITMAP_HIGH2_REG register
 *  select valid pvt channel
 */
#define PVT_PMUP_BITMAP_HIGH2_REG (DR_REG_PVT_BASE + 0x8)
/** PVT_PUMP_BITMAP_HIGH2 : R/W; bitpos: [31:0]; default: 0;
 *  select valid high channel2
 */
#define PVT_PUMP_BITMAP_HIGH2    0xFFFFFFFFU
#define PVT_PUMP_BITMAP_HIGH2_M  (PVT_PUMP_BITMAP_HIGH2_V << PVT_PUMP_BITMAP_HIGH2_S)
#define PVT_PUMP_BITMAP_HIGH2_V  0xFFFFFFFFU
#define PVT_PUMP_BITMAP_HIGH2_S  0

/** PVT_PMUP_BITMAP_HIGH3_REG register
 *  select valid pvt channel
 */
#define PVT_PMUP_BITMAP_HIGH3_REG (DR_REG_PVT_BASE + 0xc)
/** PVT_PUMP_BITMAP_HIGH3 : R/W; bitpos: [31:0]; default: 0;
 *  select valid high channel3
 */
#define PVT_PUMP_BITMAP_HIGH3    0xFFFFFFFFU
#define PVT_PUMP_BITMAP_HIGH3_M  (PVT_PUMP_BITMAP_HIGH3_V << PVT_PUMP_BITMAP_HIGH3_S)
#define PVT_PUMP_BITMAP_HIGH3_V  0xFFFFFFFFU
#define PVT_PUMP_BITMAP_HIGH3_S  0

/** PVT_PMUP_BITMAP_HIGH4_REG register
 *  select valid pvt channel
 */
#define PVT_PMUP_BITMAP_HIGH4_REG (DR_REG_PVT_BASE + 0x10)
/** PVT_PUMP_BITMAP_HIGH4 : R/W; bitpos: [31:0]; default: 0;
 *  select valid high channel4
 */
#define PVT_PUMP_BITMAP_HIGH4    0xFFFFFFFFU
#define PVT_PUMP_BITMAP_HIGH4_M  (PVT_PUMP_BITMAP_HIGH4_V << PVT_PUMP_BITMAP_HIGH4_S)
#define PVT_PUMP_BITMAP_HIGH4_V  0xFFFFFFFFU
#define PVT_PUMP_BITMAP_HIGH4_S  0

/** PVT_PMUP_BITMAP_LOW0_REG register
 *  select valid pvt channel
 */
#define PVT_PMUP_BITMAP_LOW0_REG (DR_REG_PVT_BASE + 0x14)
/** PVT_PUMP_BITMAP_LOW0 : R/W; bitpos: [31:0]; default: 0;
 *  select valid low channel0
 */
#define PVT_PUMP_BITMAP_LOW0    0xFFFFFFFFU
#define PVT_PUMP_BITMAP_LOW0_M  (PVT_PUMP_BITMAP_LOW0_V << PVT_PUMP_BITMAP_LOW0_S)
#define PVT_PUMP_BITMAP_LOW0_V  0xFFFFFFFFU
#define PVT_PUMP_BITMAP_LOW0_S  0

/** PVT_PMUP_BITMAP_LOW1_REG register
 *  select valid pvt channel
 */
#define PVT_PMUP_BITMAP_LOW1_REG (DR_REG_PVT_BASE + 0x18)
/** PVT_PUMP_BITMAP_LOW1 : R/W; bitpos: [31:0]; default: 0;
 *  select valid low channel1
 */
#define PVT_PUMP_BITMAP_LOW1    0xFFFFFFFFU
#define PVT_PUMP_BITMAP_LOW1_M  (PVT_PUMP_BITMAP_LOW1_V << PVT_PUMP_BITMAP_LOW1_S)
#define PVT_PUMP_BITMAP_LOW1_V  0xFFFFFFFFU
#define PVT_PUMP_BITMAP_LOW1_S  0

/** PVT_PMUP_BITMAP_LOW2_REG register
 *  select valid pvt channel
 */
#define PVT_PMUP_BITMAP_LOW2_REG (DR_REG_PVT_BASE + 0x1c)
/** PVT_PUMP_BITMAP_LOW2 : R/W; bitpos: [31:0]; default: 0;
 *  select valid low channel2
 */
#define PVT_PUMP_BITMAP_LOW2    0xFFFFFFFFU
#define PVT_PUMP_BITMAP_LOW2_M  (PVT_PUMP_BITMAP_LOW2_V << PVT_PUMP_BITMAP_LOW2_S)
#define PVT_PUMP_BITMAP_LOW2_V  0xFFFFFFFFU
#define PVT_PUMP_BITMAP_LOW2_S  0

/** PVT_PMUP_BITMAP_LOW3_REG register
 *  select valid pvt channel
 */
#define PVT_PMUP_BITMAP_LOW3_REG (DR_REG_PVT_BASE + 0x20)
/** PVT_PUMP_BITMAP_LOW3 : R/W; bitpos: [31:0]; default: 0;
 *  select valid low channel3
 */
#define PVT_PUMP_BITMAP_LOW3    0xFFFFFFFFU
#define PVT_PUMP_BITMAP_LOW3_M  (PVT_PUMP_BITMAP_LOW3_V << PVT_PUMP_BITMAP_LOW3_S)
#define PVT_PUMP_BITMAP_LOW3_V  0xFFFFFFFFU
#define PVT_PUMP_BITMAP_LOW3_S  0

/** PVT_PMUP_BITMAP_LOW4_REG register
 *  select valid pvt channel
 */
#define PVT_PMUP_BITMAP_LOW4_REG (DR_REG_PVT_BASE + 0x24)
/** PVT_PUMP_BITMAP_LOW4 : R/W; bitpos: [31:0]; default: 0;
 *  select valid low channel4
 */
#define PVT_PUMP_BITMAP_LOW4    0xFFFFFFFFU
#define PVT_PUMP_BITMAP_LOW4_M  (PVT_PUMP_BITMAP_LOW4_V << PVT_PUMP_BITMAP_LOW4_S)
#define PVT_PUMP_BITMAP_LOW4_V  0xFFFFFFFFU
#define PVT_PUMP_BITMAP_LOW4_S  0

/** PVT_PMUP_DRV_CFG_REG register
 *  configure pump drv
 */
#define PVT_PMUP_DRV_CFG_REG (DR_REG_PVT_BASE + 0x28)
/** PVT_PUMP_EN : R/W; bitpos: [9]; default: 0;
 *  configure pvt charge xpd
 */
#define PVT_PUMP_EN    (BIT(9))
#define PVT_PUMP_EN_M  (PVT_PUMP_EN_V << PVT_PUMP_EN_S)
#define PVT_PUMP_EN_V  0x00000001U
#define PVT_PUMP_EN_S  9
/** PVT_CLK_EN : R/W; bitpos: [10]; default: 0;
 *  force register clken
 */
#define PVT_CLK_EN    (BIT(10))
#define PVT_CLK_EN_M  (PVT_CLK_EN_V << PVT_CLK_EN_S)
#define PVT_CLK_EN_V  0x00000001U
#define PVT_CLK_EN_S  10
/** PVT_PUMP_DRV4 : R/W; bitpos: [14:11]; default: 0;
 *  configure cmd4 drv
 */
#define PVT_PUMP_DRV4    0x0000000FU
#define PVT_PUMP_DRV4_M  (PVT_PUMP_DRV4_V << PVT_PUMP_DRV4_S)
#define PVT_PUMP_DRV4_V  0x0000000FU
#define PVT_PUMP_DRV4_S  11
/** PVT_PUMP_DRV3 : R/W; bitpos: [18:15]; default: 0;
 *  configure cmd3 drv
 */
#define PVT_PUMP_DRV3    0x0000000FU
#define PVT_PUMP_DRV3_M  (PVT_PUMP_DRV3_V << PVT_PUMP_DRV3_S)
#define PVT_PUMP_DRV3_V  0x0000000FU
#define PVT_PUMP_DRV3_S  15
/** PVT_PUMP_DRV2 : R/W; bitpos: [22:19]; default: 0;
 *  configure cmd2 drv
 */
#define PVT_PUMP_DRV2    0x0000000FU
#define PVT_PUMP_DRV2_M  (PVT_PUMP_DRV2_V << PVT_PUMP_DRV2_S)
#define PVT_PUMP_DRV2_V  0x0000000FU
#define PVT_PUMP_DRV2_S  19
/** PVT_PUMP_DRV1 : R/W; bitpos: [26:23]; default: 0;
 *  configure cmd1 drv
 */
#define PVT_PUMP_DRV1    0x0000000FU
#define PVT_PUMP_DRV1_M  (PVT_PUMP_DRV1_V << PVT_PUMP_DRV1_S)
#define PVT_PUMP_DRV1_V  0x0000000FU
#define PVT_PUMP_DRV1_S  23
/** PVT_PUMP_DRV0 : R/W; bitpos: [30:27]; default: 0;
 *  configure cmd0 drv
 */
#define PVT_PUMP_DRV0    0x0000000FU
#define PVT_PUMP_DRV0_M  (PVT_PUMP_DRV0_V << PVT_PUMP_DRV0_S)
#define PVT_PUMP_DRV0_V  0x0000000FU
#define PVT_PUMP_DRV0_S  27

/** PVT_PMUP_CHANNEL_CFG_REG register
 *  configure the code of valid pump channel code
 */
#define PVT_PMUP_CHANNEL_CFG_REG (DR_REG_PVT_BASE + 0x2c)
/** PVT_PUMP_CHANNEL_CODE4 : R/W; bitpos: [11:7]; default: 0;
 *  configure cmd4 code
 */
#define PVT_PUMP_CHANNEL_CODE4    0x0000001FU
#define PVT_PUMP_CHANNEL_CODE4_M  (PVT_PUMP_CHANNEL_CODE4_V << PVT_PUMP_CHANNEL_CODE4_S)
#define PVT_PUMP_CHANNEL_CODE4_V  0x0000001FU
#define PVT_PUMP_CHANNEL_CODE4_S  7
/** PVT_PUMP_CHANNEL_CODE3 : R/W; bitpos: [16:12]; default: 0;
 *  configure cmd3 code
 */
#define PVT_PUMP_CHANNEL_CODE3    0x0000001FU
#define PVT_PUMP_CHANNEL_CODE3_M  (PVT_PUMP_CHANNEL_CODE3_V << PVT_PUMP_CHANNEL_CODE3_S)
#define PVT_PUMP_CHANNEL_CODE3_V  0x0000001FU
#define PVT_PUMP_CHANNEL_CODE3_S  12
/** PVT_PUMP_CHANNEL_CODE2 : R/W; bitpos: [21:17]; default: 0;
 *  configure cmd2 code
 */
#define PVT_PUMP_CHANNEL_CODE2    0x0000001FU
#define PVT_PUMP_CHANNEL_CODE2_M  (PVT_PUMP_CHANNEL_CODE2_V << PVT_PUMP_CHANNEL_CODE2_S)
#define PVT_PUMP_CHANNEL_CODE2_V  0x0000001FU
#define PVT_PUMP_CHANNEL_CODE2_S  17
/** PVT_PUMP_CHANNEL_CODE1 : R/W; bitpos: [26:22]; default: 0;
 *  configure cmd1 code
 */
#define PVT_PUMP_CHANNEL_CODE1    0x0000001FU
#define PVT_PUMP_CHANNEL_CODE1_M  (PVT_PUMP_CHANNEL_CODE1_V << PVT_PUMP_CHANNEL_CODE1_S)
#define PVT_PUMP_CHANNEL_CODE1_V  0x0000001FU
#define PVT_PUMP_CHANNEL_CODE1_S  22
/** PVT_PUMP_CHANNEL_CODE0 : R/W; bitpos: [31:27]; default: 0;
 *  configure cmd0 code
 */
#define PVT_PUMP_CHANNEL_CODE0    0x0000001FU
#define PVT_PUMP_CHANNEL_CODE0_M  (PVT_PUMP_CHANNEL_CODE0_V << PVT_PUMP_CHANNEL_CODE0_S)
#define PVT_PUMP_CHANNEL_CODE0_V  0x0000001FU
#define PVT_PUMP_CHANNEL_CODE0_S  27

/** PVT_CLK_CFG_REG register
 *  configure pvt clk
 */
#define PVT_CLK_CFG_REG (DR_REG_PVT_BASE + 0x30)
/** PVT_PUMP_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  needs field desc
 */
#define PVT_PUMP_CLK_DIV_NUM    0x000000FFU
#define PVT_PUMP_CLK_DIV_NUM_M  (PVT_PUMP_CLK_DIV_NUM_V << PVT_PUMP_CLK_DIV_NUM_S)
#define PVT_PUMP_CLK_DIV_NUM_V  0x000000FFU
#define PVT_PUMP_CLK_DIV_NUM_S  0
/** PVT_MONITOR_CLK_PVT_EN : R/W; bitpos: [8]; default: 0;
 *  needs field desc
 */
#define PVT_MONITOR_CLK_PVT_EN    (BIT(8))
#define PVT_MONITOR_CLK_PVT_EN_M  (PVT_MONITOR_CLK_PVT_EN_V << PVT_MONITOR_CLK_PVT_EN_S)
#define PVT_MONITOR_CLK_PVT_EN_V  0x00000001U
#define PVT_MONITOR_CLK_PVT_EN_S  8
/** PVT_CLK_SEL : R/W; bitpos: [31]; default: 0;
 *  select pvt clk
 */
#define PVT_CLK_SEL    (BIT(31))
#define PVT_CLK_SEL_M  (PVT_CLK_SEL_V << PVT_CLK_SEL_S)
#define PVT_CLK_SEL_V  0x00000001U
#define PVT_CLK_SEL_S  31

/** PVT_DBIAS_CHANNEL_SEL0_REG register
 *  needs desc
 */
#define PVT_DBIAS_CHANNEL_SEL0_REG (DR_REG_PVT_BASE + 0x34)
/** PVT_DBIAS_CHANNEL3_SEL : R/W; bitpos: [10:4]; default: 64;
 *  needs field desc
 */
#define PVT_DBIAS_CHANNEL3_SEL    0x0000007FU
#define PVT_DBIAS_CHANNEL3_SEL_M  (PVT_DBIAS_CHANNEL3_SEL_V << PVT_DBIAS_CHANNEL3_SEL_S)
#define PVT_DBIAS_CHANNEL3_SEL_V  0x0000007FU
#define PVT_DBIAS_CHANNEL3_SEL_S  4
/** PVT_DBIAS_CHANNEL2_SEL : R/W; bitpos: [17:11]; default: 64;
 *  needs field desc
 */
#define PVT_DBIAS_CHANNEL2_SEL    0x0000007FU
#define PVT_DBIAS_CHANNEL2_SEL_M  (PVT_DBIAS_CHANNEL2_SEL_V << PVT_DBIAS_CHANNEL2_SEL_S)
#define PVT_DBIAS_CHANNEL2_SEL_V  0x0000007FU
#define PVT_DBIAS_CHANNEL2_SEL_S  11
/** PVT_DBIAS_CHANNEL1_SEL : R/W; bitpos: [24:18]; default: 64;
 *  needs field desc
 */
#define PVT_DBIAS_CHANNEL1_SEL    0x0000007FU
#define PVT_DBIAS_CHANNEL1_SEL_M  (PVT_DBIAS_CHANNEL1_SEL_V << PVT_DBIAS_CHANNEL1_SEL_S)
#define PVT_DBIAS_CHANNEL1_SEL_V  0x0000007FU
#define PVT_DBIAS_CHANNEL1_SEL_S  18
/** PVT_DBIAS_CHANNEL0_SEL : R/W; bitpos: [31:25]; default: 64;
 *  needs field desc
 */
#define PVT_DBIAS_CHANNEL0_SEL    0x0000007FU
#define PVT_DBIAS_CHANNEL0_SEL_M  (PVT_DBIAS_CHANNEL0_SEL_V << PVT_DBIAS_CHANNEL0_SEL_S)
#define PVT_DBIAS_CHANNEL0_SEL_V  0x0000007FU
#define PVT_DBIAS_CHANNEL0_SEL_S  25

/** PVT_DBIAS_CHANNEL_SEL1_REG register
 *  needs desc
 */
#define PVT_DBIAS_CHANNEL_SEL1_REG (DR_REG_PVT_BASE + 0x38)
/** PVT_DBIAS_CHANNEL4_SEL : R/W; bitpos: [31:25]; default: 64;
 *  needs field desc
 */
#define PVT_DBIAS_CHANNEL4_SEL    0x0000007FU
#define PVT_DBIAS_CHANNEL4_SEL_M  (PVT_DBIAS_CHANNEL4_SEL_V << PVT_DBIAS_CHANNEL4_SEL_S)
#define PVT_DBIAS_CHANNEL4_SEL_V  0x0000007FU
#define PVT_DBIAS_CHANNEL4_SEL_S  25

/** PVT_DBIAS_CHANNEL0_SEL_REG register
 *  needs desc
 */
#define PVT_DBIAS_CHANNEL0_SEL_REG (DR_REG_PVT_BASE + 0x3c)
/** PVT_DBIAS_CHANNEL0_CFG : R/W; bitpos: [16:0]; default: 0;
 *  needs field desc
 */
#define PVT_DBIAS_CHANNEL0_CFG    0x0001FFFFU
#define PVT_DBIAS_CHANNEL0_CFG_M  (PVT_DBIAS_CHANNEL0_CFG_V << PVT_DBIAS_CHANNEL0_CFG_S)
#define PVT_DBIAS_CHANNEL0_CFG_V  0x0001FFFFU
#define PVT_DBIAS_CHANNEL0_CFG_S  0

/** PVT_DBIAS_CHANNEL1_SEL_REG register
 *  needs desc
 */
#define PVT_DBIAS_CHANNEL1_SEL_REG (DR_REG_PVT_BASE + 0x40)
/** PVT_DBIAS_CHANNEL1_CFG : R/W; bitpos: [16:0]; default: 0;
 *  needs field desc
 */
#define PVT_DBIAS_CHANNEL1_CFG    0x0001FFFFU
#define PVT_DBIAS_CHANNEL1_CFG_M  (PVT_DBIAS_CHANNEL1_CFG_V << PVT_DBIAS_CHANNEL1_CFG_S)
#define PVT_DBIAS_CHANNEL1_CFG_V  0x0001FFFFU
#define PVT_DBIAS_CHANNEL1_CFG_S  0

